stockbyte-app/app/controllers/portfolios_controller.rb

    def index
      if current_user
        @portfolio = current_user.portfolios.all
      else
        @user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def create
      if current_user
        @portfolio = current_user.portfolios.create(portfolio_params)
      else
        @user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]