stockbyte-app/app/controllers/portfolios_controller.rb

    def index
      if current_user
        @portfolio = current_user.portfolios.all
      else
        @user = User.first
        @portfolio = @user.portfolios.all
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1  [["user_id", 1]]

    def create
      if current_user
        @portfolio = current_user.portfolios.create(portfolio_params)
---
INSERT INTO "portfolios" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["name", "default"], ["created_at", "2020-04-09 17:57:31.833107"], ["updated_at", "2020-04-09 17:57:31.833107"]]