stockbyte-app/app/controllers/stocks_controller.rb

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" IS NULL LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1  [["user_id", 2]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1  [["portfolio_id", 1]]
---
  def index
    #Assigns user if there is no current user
    if current_user
      @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
    else
      @user = User.first
      @portfolio = @user.portfolios.find_by(name: params[:portfolio])
    end
    @stocks=@portfolio.stocks.all

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."id" = $2 LIMIT $3  [["portfolio_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    #Assigns user if there is no current user
    if current_user
      @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
    else
      @user = User.first
      @portfolio = @user.portfolios.find_by(name: params[:portfolio])
    end

    @stock=@portfolio.stocks.find(params[:id])

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 2], ["name", "default"], ["LIMIT", 1]]
INSERT INTO "stocks" ("symbol", "portfolio_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["symbol", "AAPL"], ["portfolio_id", 2], ["created_at", "2020-04-09 22:22:26.080391"], ["updated_at", "2020-04-09 22:22:26.080391"]]
---
  def create
    #Assigns user if there is no current user
    if current_user
      @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
    else
      @user = User.first
      @portfolio = @user.portfolios.find_by(name: params[:portfolio])
    end

    @stock = @portfolio.stocks.create(stock_params)