stockbyte-app/app/controllers/stocks_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def create
    #Assigns user if there is no current user
    if current_user
      @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
    else
      @user = User.first