stockbyte-app/app/controllers/trades_controller.rb

    def index
        if current_user
            @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
        else
            @user = User.first
            @portfolio = @user.portfolios.find_by(name: params[:portfolio])
        end
        @stock = @portfolio.stocks.find_by(symbol: params[:stock])
        @trades = @stock.trades.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "trades".* FROM "trades"

    def create
        if current_user
            @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
        else
            @user = User.first
            @portfolio = @user.portfolios.find_by(name: params[:portfolio])
        end
        @stock = @portfolio.stocks.find_by(symbol: params[:stock])
        @trade = @stock.trades.create(trade_params)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 10], ["name", "test_portfolio"], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."symbol" = $2 LIMIT $3  [["portfolio_id", 10], ["symbol", "TEST"], ["LIMIT", 1]]
INSERT INTO "trades" ("action", "price", "quantity", "stock_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["action", 1], ["price", 100.0], ["quantity", 20], ["stock_id", 10], ["created_at", "2020-04-07 23:06:23.695672"], ["updated_at", "2020-04-07 23:06:23.695672"]]