stockbyte-app/app/controllers/trades_controller.rb

    def index
        if current_user
            @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
        else
            @user = User.first
            @portfolio = @user.portfolios.find_by(name: params[:portfolio])
        end
        @stock = @portfolio.stocks.find_by(symbol: params[:stock])
        @trades = @stock.trades.all
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."symbol" = $2 LIMIT $3  [["portfolio_id", 1], ["symbol", "AAPL"], ["LIMIT", 1]]
SELECT "trades".* FROM "trades" WHERE "trades"."stock_id" = $1  [["stock_id", 1]]

    def create
        if current_user
            @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]