stockbyte-app/app/models/stock.rb

SELECT "trades".* FROM "trades" WHERE "trades"."stock_id" = $1  [["stock_id", 1]]
---
    def total_quantity
        Trade.all.sum(:quantity)