app/controllers/stocks_controller.rb

  def index
    #Assigns user if there is no current user
    if current_user
      @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
      @stocks=@portfolio.stocks.all
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 2], ["name", "default"], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1  [["user_id", 5]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."id" = $2 LIMIT $3  [["portfolio_id", 1], ["id", 3], ["LIMIT", 1]]

  def show
    #Assigns user if there is no current user
    if current_user
      @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
      @stock=@portfolio.stocks.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."id" = $2 LIMIT $3  [["portfolio_id", 1], ["id", 8], ["LIMIT", 1]]

  def create
    #Assigns user if there is no current user
    if current_user
      @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
      @stock = @portfolio.stocks.create(stock_params)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]
INSERT INTO "stocks" ("symbol", "portfolio_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["symbol", "bb"], ["portfolio_id", 1], ["created_at", "2020-04-13 16:50:08.018865"], ["updated_at", "2020-04-13 16:50:08.018865"]]

  def destroy
    if current_user
      @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
      @stock=@portfolio.stocks.find(params[:id])
      @stock.destroy
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."id" = $2 LIMIT $3  [["portfolio_id", 2], ["id", 20], ["LIMIT", 1]]
DELETE FROM "stocks" WHERE "stocks"."id" = $1  [["id", 20]]