app/controllers/trades_controller.rb

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 2], ["name", "default"], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."symbol" = $2 LIMIT $3  [["portfolio_id", 1], ["symbol", "AAPL"], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."symbol" = $2 LIMIT $3  [["portfolio_id", 1], ["symbol", "AMZN"], ["LIMIT", 1]]
SELECT "trades".* FROM "trades" WHERE "trades"."stock_id" = $1  [["stock_id", 5]]
---
    def index
        #Assigns Users if there is no current user
        if current_user
            @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
        else
            @user = User.first
            @portfolio = @user.portfolios.find_by(name: params[:portfolio])
        end

        @stock = @portfolio.stocks.find_by(symbol: params[:stock])
        @trades = @stock.trades.all

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 4], ["name", "default"], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."symbol" = $2 LIMIT $3  [["portfolio_id", 3], ["symbol", "AMZN"], ["LIMIT", 1]]
INSERT INTO "trades" ("action", "price", "quantity", "stock_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["action", -1], ["price", 10.0], ["quantity", 10], ["stock_id", 5], ["created_at", "2020-04-10 17:17:48.838839"], ["updated_at", "2020-04-10 17:17:48.838839"]]
---
    def create
        #Assigns user if there is no current user
        if current_user
            @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
        else
            @user = User.first
            @portfolio = @user.portfolios.find_by(name: params[:portfolio])
        end

        @stock = @portfolio.stocks.find_by(symbol: params[:stock])
        @trade = @stock.trades.create(trade_params)

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "default"], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."portfolio_id" = $1 AND "stocks"."symbol" = $2 LIMIT $3  [["portfolio_id", 1], ["symbol", "AMZN"], ["LIMIT", 1]]
SELECT "trades".* FROM "trades" WHERE "trades"."stock_id" = $1 AND "trades"."id" = $2 LIMIT $3  [["stock_id", 7], ["id", 24], ["LIMIT", 1]]
DELETE FROM "trades" WHERE "trades"."id" = $1  [["id", 24]]
---
    def destroy
      if current_user
        @portfolio = current_user.portfolios.find_by(name: params[:portfolio])
      else
        @user = User.first
        @portfolio = @user.portfolios.find_by(name: params[:portfolio])
      end
      @stock = @portfolio.stocks.find_by(symbol: params[:stock])
      @trade = @stock.trades.find(params[:id])
      @trade.destroy